//
//  ViewController.swift
//  CoreTextSwift
//
//  Created by Sureshbabu Naidu on 29/11/16.
//  Copyright © 2016 Vishwak Sol pvt. ltd. All rights reserved.
//

import UIKit
import  CoreText
class ViewController: UIViewController,UIScrollViewDelegate {
    var textManger : NSTextStorage!
    var layoutManager : NSLayoutManager!
    var textView = UITextView()
    @IBOutlet var scrollObj: UIScrollView!
    @IBOutlet var pageDots: UIPageControl!
    override func viewDidLoad() {
        super.viewDidLoad()
        let contentURL = Bundle.main.url(forResource: "content", withExtension: "txt")
        do {
            self.textManger = try NSTextStorage(url: contentURL!, options: [:], documentAttributes: nil)
        }
        catch {
            
        }
        self.layoutManager = NSLayoutManager()
        textManger.addLayoutManager(layoutManager)
        self . ect()
        NotificationCenter.default.addObserver(self, selector: #selector(self.rotated), name: NSNotification.Name.UIDeviceOrientationDidChange, object: nil)
        // Do any additional setup after loading the view, typically from a nib.
    }
    func rotated() {
        if UIDevice.current.orientation.isLandscape {
            print("Landscape")
            view.layoutIfNeeded()
        } else {
            print("Portrait")
            view.layoutIfNeeded()
        }
        //        self . ect()
    }
    func ect() {
        var columnIndex: CGFloat = 0
        var lastRenderedGlyph = 0
        var currentXOffset: CGFloat = 0
        var columnSize = CGSize()
        var textViewFrame = CGRect()
        do {
            while lastRenderedGlyph < layoutManager.numberOfGlyphs {
                if columnIndex == 1  {
                    let imageView = UIImageView()
                    imageView.image = UIImage(named: "zombie2.jpg")
                    imageView.frame =  CGRect(x: currentXOffset, y: 20, width: textViewFrame.size.width + textViewFrame.size.width-10, height: 200)
                    self.scrollObj .addSubview(imageView)
                    
                    textViewFrame = CGRect(x: currentXOffset, y: CGFloat(200), width: CGFloat(self.view.bounds.width / 3), height: CGFloat(self.view.bounds.height - 274))
                    
                    columnSize = CGSize(width: CGFloat(textViewFrame.width - 20), height: CGFloat(textViewFrame.height - 20))
                    
                    
                }else if columnIndex == 2{
                    textViewFrame = CGRect(x: currentXOffset, y: CGFloat(200), width: CGFloat(self.view.bounds.width / 3), height: CGFloat(self.view.bounds.height - 274))
                    
                    columnSize = CGSize(width: CGFloat(textViewFrame.width - 20), height: CGFloat(textViewFrame.height - 20))
                }
                else{
                    textViewFrame = CGRect(x: currentXOffset, y: 0, width: CGFloat(self.view.bounds.width / 3), height: CGFloat(self.view.bounds.height - 74))
                    
                    columnSize = CGSize(width: CGFloat(textViewFrame.width - 20), height: CGFloat(textViewFrame.height - 20))
                }
                
                //                if columnIndex == 1 || columnIndex == 2{
                //                    let imageView = UIImageView()
                //                    imageView.image = UIImage(named: "zombie2.jpg")
                //                    imageView.frame =  CGRect(x: 0, y: 0, width: textView.frame.size.width + 200, height: textView.frame.size.width + 100)
                //                    let path = UIBezierPath(rect: CGRect(x: 0, y:textView.frame.size.height + 200 , width: textView.frame.size.width, height: textView.frame.size.width + 200))
                //                    textView.textContainer.exclusionPaths = [path]
                //                    textView.addSubview(imageView)
                //                }
                columnIndex = columnIndex + 1
                let textContainer = NSTextContainer(size: columnSize)
                layoutManager.addTextContainer(textContainer)
                // And a text view to render it
                self.textView = UITextView(frame: textViewFrame, textContainer: textContainer)
                let htmlString = "<div style='margin: 0px; padding: 0px; font-size: 13px;'>புதுடெல்லி,</div><div style='margin: 0px; padding: 0px; font-size: 13px;'><br /></div><div style='margin: 0px; padding: 0px; font-size: 13px;'>கள்ள google.com   https://www.youtube.com/watch?v=LqHzHkuXRxQ நோட்டு மற்றும் கருப்பு பணத்தை ஒழிக்கும்<p> <h1>நடவடிக்கையாக 500, 1,000 ரூபாய் நோட்டுகள் செல்லாது என்று பிரதமர் நரேந்திர மோடி அறிவித்தார். இதை எதிர்த்து டெல்லியை சேர்ந்த வக்கீல்கள் விவேக்நாராயண்</h1> </p>சர்மா, சங்கம்லால் பாண்டே, தனிநபர்கள் எஸ்.முத்துக்குமார், அடில் ஆல்வி ஆகியோர் சுப்ரீம் கோர்ட்டில் பொதுநல மனுக்கள் தாக்கல் செய்தனர்.</div><div style='margin: 0px; padding: 0px; font-size: 13px;'><br /></div><div> <img src=\"http://img.maalaimalar.com/Articles/2016/Dec/201612271254096075_Vaiko-Announces-MDMK-Withdrew-from-Makkal-Nala-Kootani_medVPF.gif\" alt=\"\" style=\"width:500px;height:128px;\"> </div><div style='margin: 0px; padding: 0px; font-size: 13px;'>இந்த மனுவை விசாரித்த சுப்ரீம் கோர்ட்டு, மத்திய அரசின் அறிவிப்புக்கு தடை விதிக்க மறுப்பு தெரிவித்தது. மேலும் வழக்கு விசாரணையை வரும் நவம்பர் 25 ஆம் தேதிக்கு ஒத்திவைத்து ,மத்திய அரசு தற்போது உள்ள நெருக்கடியை சமாளிக்கும் வகையில் எடுத்துவரும் நடவடிக்கைகள் பற்றியும்,www.google.com    &amp;     &quot;  &#39;  &#8216;    &#8217;      &#8220;     &#8221; வருங்காலத்தில் எடுக்கப்போகும் நடவடிக்கைகள் பற்றியும் அட்டார்னி ஜெனரல் விரிவான அறிக்கையை 18–ந் தேதி தாக்கல் செய்ய வேண்டும் என்று நீதிபதி உத்தரவிட்டனர்.</div><div style='margin: 0px; padding: 0px; font-size: 13px;'><br /></div><div style='margin: 0px; padding: 0px; font-size: 13px;'>இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது.<div>  </div> இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக<div> </div> மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில்,<div>  </div> சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.</div>\n\n </div> சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.</div><br> </div> சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.</div></br>/n/n </div> சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.</div></div> இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக<div>  </div></div> இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக<div> </div></div> இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும்  மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக<div>  </div></div> இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக<div> </div></div> இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக<div> <img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSxD2QTPxW4NROWV9CB2J7DigMhpjVkCbh4FlUUt6LchrTKCP7cxxy3nU2E\" alt=\"HTML5 Icon\" style=\"width:350px;height:128px;\"> </div></div> இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக மத்திய அரசின் முடிவுக்கு எதிராக மாநில உயர் நீதிமன்றங்கள் மற்றும் மாவட்ட கீழமை நீதிமன்றங்களில் தொடரப்படும் வழக்குகளை விசாரிக்க தடைவிதிக்க வேண்டும் என்று கோரப்பட்டுள்ளது. இந்த மனுவை நாளைக்கு விசாரிக்க சுப்ரீம் கோர்ட் சம்மதம் தெரிவித்துள்ளது.இந்த நிலையில், சுப்ரீம் கோர்ட்டில் மத்திய அரசு இன்று புதிய மனு ஒன்றை தாக்கல் செய்துள்ளது. அதில், ரூபாய் நோட்டுக்கள் தொடர்பாக<div>"
                //                let htmlString = "<div>\n<img src=\"http://images.parenting.mdpcdn.com/sites/parenting.com/files/styles/slide/public/baby-santa-hat.jpg?itok=QXsVQcFZ\" width=\"200\" height=\"200\" alt=\"\" />\nஊத்துக்கோட்டை:</div><div><br /></div><div>பூண்டி ஏரியில் நீர்மட்டம் குறைந்ததை அடுத்து கிருஷ்ணா நதி நீர் பங்கீடு திட்டத்தின்படி கண்டலேறு அணையில் இருந்து கடந்த 9-ந் தேதி தண்ணீர் திறக்கப்பட்டது.</div><div><br /><br>\n</br></div><div><br /></div><div><br /></div><div>இந்த தண்ணீர் 17-ந் தேதி பூண்டி ஏரிக்கு வந்தடைந்தது. கண்டலேறு அணையில் வினாடிக்கு 1500 கனஅடி வீதம் திறக்கப்பட்ட தண்ணீர் பூண்டி ஏரிக்கு 63 கனஅடி மட்டும் வந்து சேர்ந்தது. இது படிப்படியாக குறைந்தது. நேற்று காலை தண்ணீர் வரத்து முழுவதுமாக நின்றது.</div><div><br /></div><div>ஆந்திர விவசாயிகள் தண்ணீர் திருடுவதால் பூண்டி ஏரிக்கு நீர் வரத்து முற்றிலும் தடைப்பட்டது. இதையடுத்து தண்ணீர் திருடும் விவசாயிகள் மீது நடவடிக்கை எடுக்க வேண்டும் என்று தமிழக பொதுப் பணித்துறை அதிகாரிகள் நெல்லூர்\n<img src=\"http://images.parenting.mdpcdn.com/sites/parenting.com/files/styles/slide/public/baby-santa-hat.jpg?itok=QXsVQcFZ\" width=\"300\" height=\"600\" alt=\"\" />\nமாவட்ட கலெக்டர் முத்தியாலாராஜீக்கு கடிதம் எழுதினர்.</div><div><br /></div><div>இதைத் தொடர்ந்து இது பற்றி நடவடிக்கை எடுக்க ஆந்திர பொதுப்பணித்துறை அதிகாரிகளுக்கு கலெக்டர் உத்தரவிட்டார். கண்டலேறு அணையில் இருந்து தமிழக எல்லையான ‘ஜீரோ’ பாய்ண்ட் வரை கிருஷ்ணா கால்வாயில் 152 கிலோ மீட்டர் தூரத்தில் 900 சிறிய மதகுகள் உள்ளன. இவை அனைத்தும் ஆந்திர விவசாயிகள் திறந்து வைத்ததால் பூண்டி ஏரிக்கு சென்ற தண்ணீர் முழுவதும் விவசாய நிலத்திற்கு பாய்ந்து இருப்பது தெரிந்தது.</div><div><br /></div><div>இதையடுத்து ஆந்திர\n <img src=\"http://images.parenting.mdpcdn.com/sites/parenting.com/files/styles/slide/public/baby-santa-hat.jpg?itok=QXsVQcFZ\" width=\"300\" height=\"200\" alt=\"\" />\nபொதுப்பணித்துறை அதிகாரிகள் கிருஷ்ணா கால்வாய் முழுவதும் ஆய்வு செய்து 900 மதகுகளையும் மூடி வருகின்றனர். மதகுகளை திறந்தால் கடும் நடவடிக்கை எடுக்கப்படும் என்று அதிகாரிகள் எச்சரித்து உள்ளனர்.</div><div><br /></div><div>இன்று காலை நிலவரப்படி கண்டலேறு அணையில் இருந்து 1700 கனஅடி வீதம் தண்ணீர் திறக்கப்படுகிறது. ஆனால் பூண்டி ஏரிக்கு தண்ணீர் வரத்து இல்லை. கிருஷ்ணா கால்வாயில் உள்ள மதகுகள் மூடப்பட்டு வருவதால் பூண்டி ஏரிக்கு தண்ணீர் வரத்து அதிகரிக்கும் என்று எதிர்பார்க்கப்படுகிறது.</div><div><br /></div><div>பூண்டி ஏரியில் இன்று காலை நிலவரப்படி 17 அடியாக (மொத்த உயரம் 35 அடி) நீர்மட்டம் பதிவானது. 83 மில்லியன் கனஅடி தண்ணீர் இருப்பு உள்ளது.</div><div><br /></div><div>கடந்த ஆண்டு இதே நாளில் கனமழை காரணமாக பூண்டி ஏரியில் 33.70 அடி தண்ணீர் இருந்தது குறிப்பிடத்தக்கது.</div><div>பூண்டி ஏரியில் தற்போது நீர்மட்டம் குறைந்து உள்ளதால் புழல் ஏரிக்கு லிங்க்கால்வாய் மூலம் தண்ணீர் திறப்பது நிறுத்தப்பட்டு உள்ளது.</div><div align=\"center\"><object height=\"360\"><embed src=\"https://www.youtube.com/embed/FH_BHLigMVQ \" height=\"360px\" width=\"100%\" /></object></div>"
                
                textView.attributedText = htmlString.utf8Data?.attributedString
                textView.isScrollEnabled = false
                self.scrollObj.addSubview(textView)
                // Increase the current offset
                currentXOffset += textViewFrame.width
                // And find the index of the glyph we've just rendered
                let range = layoutManager.glyphRange(for: textContainer)
                lastRenderedGlyph = range.length + range.location
                
            }
            
        }
        
        //        let imageUrl = URL(string: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSxD2QTPxW4NROWV9CB2J7DigMhpjVkCbh4FlUUt6LchrTKCP7cxxy3nU2E")
        //        let imageData = try? Data(contentsOf: imageUrl!)
        
        print(columnIndex)
        //let page : CGFloat = columnIndex * currentXOffset
        self.scrollObj.contentSize = CGSize(width: currentXOffset+20, height: self.scrollObj.frame.size.height)
        self.scrollObj.isPagingEnabled = true
        pageDots.numberOfPages = Int(columnIndex/3)
        print(currentXOffset)
    }
    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
        // Dispose of any resources that can be recreated.
    }
    
    
}
extension Data {
    var attributedString: NSAttributedString? {
        do {
            return try NSAttributedString(data: self, options:[NSDocumentTypeDocumentAttribute: NSHTMLTextDocumentType, NSCharacterEncodingDocumentAttribute: String.Encoding.utf8.rawValue], documentAttributes: nil)
        } catch let error as NSError {
            print(error.localizedDescription)
        }
        return nil
    }
}
extension String {
    var utf8Data: Data? {
        return data(using: .utf8)
    }
}
